Дошкольное_учреждение83/src/DataProcessors/ЗагрузкаЭлектроннойПочты/ЗагрузкаЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаЭлектроннойПочты</name>
</mdclass:DataProcessor>

Дошкольное_учреждение83/src/Enums/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументов</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>НеУтвержден</name>
  </enumValues>
  <enumValues>
    <name>НаРегистрации</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Владелец файла</comment>
    <type>
      <types>BusinessProcessRef.Задание</types>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <comment>Дата заема на редактирование</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <comment>Файл зашифрован</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭЦП</name>
    <comment>Файл подписан ЭЦП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <comment>Полное наименование (длиной до 256 символов)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <comment>Активная версия</comment>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияАвтор</name>
    <comment>Автор - пользователь, создавший версию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаМодификацииФайла</name>
    <comment>Дата модификации файла - в локальном времени</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаСоздания</name>
    <comment>Дата создания версии</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКод</name>
    <comment>Текущая версия код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияНомерВерсии</name>
    <comment>Номер версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРазмер</name>
    <comment>Размер файла версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРасширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияТом</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/ВходящиеДокументы/ВходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВходящиеДокументы</name>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <attributes>
    <name>АвторРезолюции</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОтветНа</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезолюции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленОтвет</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение адресата</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметПереписки</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Резолюция</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/DataProcessors/ЗагрузкаЭлектроннойПочты/Forms/ЗагрузкаЭлектроннойПочты/Module.bsl
&НаКлиенте
Процедура ОбновитьВходящие(Команда)
	
	ОбновитьСписокСообщений();
	
КонецПроцедуры

// Функция оранизует получения пароля для учетной записи, в которой он не задан
//
&НаКлиенте
Функция ЗапросПароляДоступаКПочтовомуСерверу(УчетнаяЗапись)
	
	ПараметрУчетнаяЗапись = Новый Структура("УчетнаяЗапись", УчетнаяЗапись);
	Пароль = ОткрытьФормуМодально("ОбщаяФорма.ПодтверждениеПароляУчетнойЗаписи",
	                                 ПараметрУчетнаяЗапись);
	Если ТипЗнч(Пароль) = Тип("Строка") Тогда
		Возврат Пароль;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция обрабатывает загрузку почтовых сообщений с сервера.
// В том числе обработка ошибок.
//
&НаСервере
Функция ЗагрузитьВходящиеСообщения(знач ПарольПараметр = Неопределено)
	
	ПараметрыЗагрузки = Новый Структура;
	
	ПараметрыЗагрузки.Вставить("Колоноки", "ИмяОтправителя, Вложения, Тема, ДатаОтправления, ОбратныйАдрес");
	ПараметрыЗагрузки.Вставить("Пароль", ПарольПараметр);
	
	ТаблицаВходящихСообщений = ЭлектроннаяПочта.ЗагрузитьПочтовыеСообщения(УчетнаяЗаписьВходящие, ПараметрыЗагрузки);
	
	ВходящиеСообщения.Очистить();
	
	Для Каждого ЭлементВходящееСообщение Из ТаблицаВходящихСообщений Цикл
		
		НоваяСтрока = ВходящиеСообщения.Добавить();
		НоваяСтрока.Отправитель     = ЭлементВходящееСообщение.Отправитель;
		НоваяСтрока.ОбратныйАдрес   = ЭлементВходящееСообщение.ОбратныйАдрес;
		НоваяСтрока.Тема            = ЭлементВходящееСообщение.Тема;
		НоваяСтрока.ДатаОтправления = ЭлементВходящееСообщение.ДатаОтправления;
		НоваяСтрока.ДатаПолучения   = ЭлементВходящееСообщение.ДатаПолучения;
		НоваяСтрока.Идентификатор   = ЭлементВходящееСообщение.Идентификатор[0];
		НоваяСтрока.Размер          = ЭлементВходящееСообщение.Размер / 1024;
		Если НоваяСтрока.Размер = 0 Тогда
			НоваяСтрока.Размер = 1;
		КонецЕсли;	
		
		Для каждого Текст из ЭлементВходящееСообщение.Тексты Цикл
			
			ТипТекста = Текст.Получить("ТипТекста");
			Если ТипТекста = Строка( ТипТекстаПочтовогоСообщения.ПростойТекст) Тогда
				НоваяСтрока.Содержание = НоваяСтрока.Содержание + Текст.Получить("Текст");
			КонецЕсли;
			
		КонецЦикла;	
		
		Если ЭлементВходящееСообщение.Вложения.Количество() > 0 Тогда
			НоваяСтрока.Вложение = Истина;
		Иначе
			НоваяСтрока.Вложение = Ложь;
		КонецЕсли;
		
		Для каждого Вложение Из ЭлементВходящееСообщение.Вложения Цикл
			НовоеВложение = НоваяСтрока.Вложения.Добавить();
			НовоеВложение.Имя = Вложение.Ключ;
			НовоеВложение.НавигационнаяСсылка = ПоместитьВоВременноеХранилище(Вложение.Значение, ЭтаФорма.УникальныйИдентификатор);
			НовоеВложение.Размер = Вложение.Значение.Размер() / 1024;
			Если НовоеВложение.Размер = 0 Тогда
				НовоеВложение.Размер = 1;
			КонецЕсли	
		КонецЦикла;
		
	КонецЦикла;
	
	РезСтрук = Новый Структура("Статус", Истина);
	
	Возврат РезСтрук;
	
КонецФункции

// Проверяет задан пароль у учетной записи или нет
// Параметры
// УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты
// Возвращаемое значение
// Истина - пароль задан
// Ложь   - пароль не задан
//
&НаСервере
Функция ПарольЗадан(УчетнаяЗапись)
	
	Если ЗначениеЗаполнено(УчетнаяЗапись.Пароль) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли
	
КонецФункции

&НаСервере
Функция ПолучитьВерсииФайлов(ВладелецФайла)
	
	МассивДанныхФВерсийФайлов = Новый Массив();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.ТекущаяВерсия
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр( "ВладелецФайла", ВладелецФайла );
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка из Данные Цикл
		МассивДанныхФВерсийФайлов.Добавить(Строка.ТекущаяВерсия);
	КонецЦикла;	
	
	Возврат МассивДанныхФВерсийФайлов;
	
КонецФункции	

&НаКлиенте
Процедура ИзвлечьТекстыИзФайлов(ВладелецФайла)
	
#Если Не ВебКлиент Тогда
	МассивДанныхВерсийФайлов = ПолучитьВерсииФайлов(ВладелецФайла);
	
	Для каждого Версия Из МассивДанныхВерсийФайлов Цикл
		
		СтруктураВозврата = РаботаСФайлами.ПолучитьДанныеФайлаИНавигационнуюСсылкуВерсии(, Версия, УникальныйИдентификатор);
		ДанныеФайла = СтруктураВозврата.ДанныеФайла;
		АдресФайла = СтруктураВозврата.НавигационнаяСсылкаВерсии;
		
		Если ДанныеФайла.СтатусИзвлеченияТекста <> "НеИзвлечен" Тогда
			
			// Для варианта с хранением файлов на диске (на сервере) удаляем Файл из временного хранилища после получения.
			Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
				УдалитьИзВременногоХранилища(АдресФайла);
			КонецЕсли;
			
		КонецЕсли;	
		
		Расширение = ДанныеФайла.Расширение;
		
		ФайловыеФункцииКлиент.ИзвлечьТекстВерсии(Версия, АдресФайла, Расширение, УникальныйИдентификатор);
		
	КонецЦикла;	
#КонецЕсли

КонецПроцедуры	

&НаКлиенте
Процедура ВходящийДокумент(Команда)
	
	Если Элементы.ВходящиеСообщения.ТекущаяСтрока <> Неопределено Тогда
		
		Форма = ПолучитьФорму("Обработка.ЗагрузкаЭлектроннойПочты.Форма.ФормаДобавленияВходящегоДокумента", );
		Если Форма.ОткрытьМодально() <> КодВозвратаДиалога.ОК Тогда 
			Возврат;
		КонецЕсли;	
		
		Состояние(НСтр("ru = 'Идет регистрация входящего документа. Пожалуйста, подождите...'"));
		ВходящийДокумент = СоздатьВходящийДокумент(
			Элементы.ВходящиеСообщения.ТекущаяСтрока,
			Форма.Отправитель,
			Форма.ГрифДоступа,
			Форма.ВидДокумента,
			Форма.Организация);
			
		Если Не ВходящийДокумент.Пустая() Тогда
			УдалитьТекущееСообщение();
			ИзвлечьТекстыИзФайлов(ВходящийДокумент);
			ОткрытьЗначение(ВходящийДокумент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьВходящийДокумент(НомерПисьма, Корреспондент, ГрифДоступа, ВидДокумента, Организация)
	
	Письмо = ВходящиеСообщения.НайтиПоИдентификатору(НомерПисьма);

	// Создаем входящий документ
	ВходящийДокумент = Справочники.ВходящиеДокументы.СоздатьЭлемент();
	ВходящийДокумент.Заголовок = Письмо.Тема;
	ВходящийДокумент.Содержание = Письмо.Содержание;
	ВходящийДокумент.ИсходящаяДата = Письмо.ДатаОтправления;
	ВходящийДокумент.ДатаСоздания = Письмо.ДатаПолучения;
	ВходящийДокумент.Отправитель = Корреспондент;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступаКВходящимИИсходящимДокументам") Тогда
		ВходящийДокумент.ГрифДоступа = ГрифДоступа;
	КонецЕсли;	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыВходящихДокументов") Тогда
		ВходящийДокумент.ВидДокумента = ВидДокумента;
	КонецЕсли;	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		ВходящийДокумент.Организация = Организация;
	КонецЕсли;	
	
	НачатьТранзакцию();
	Попытка
		ВходящийДокумент.Записать();
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			ВходящийДокумент.Ссылка, 
			ТекущаяДата(), 
			Перечисления.СостоянияДокументов.НаРегистрации, 
			ОбщегоНазначения.ТекущийПользователь());
		
		// Сохраняем все файлы на диске
		Для каждого Вложение Из Письмо.Вложения Цикл
			
			ВрФайл = Новый Файл(Вложение.Имя);
			ИмяФайла = ВрФайл.ИмяБезРасширения;
			РасширениеФайла = РасширениеБезТочки(ВрФайл.Расширение);
			
			// Создадим карточку Файла в БД
			НовыйФайл = РаботаСФайлами.СоздатьФайлСВерсией(
				ВходящийДокумент.Ссылка,
				ИмяФайла,
				РасширениеФайла,
				ТекущаяДата(),
				УниверсальноеВремя(ТекущаяДата()),
				Вложение.Размер,
				Вложение.НавигационнаяСсылка,
				"",
				Ложь); // это не веб клиент				
				
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
	     ОтменитьТранзакцию();
	     ВызватьИсключение;
	КонецПопытки;
	
	Возврат ВходящийДокумент.Ссылка;
	
КонецФункции

&НаСервере
Функция РасширениеБезТочки(стрРасширение)
	
	Расширение = НРег(СокрЛП(стрРасширение));
	Если Сред(Расширение, 1, 1) = "." Тогда
		Расширение = Сред(Расширение, 2);
	КонецЕсли;
	Возврат Расширение;
	
КонецФункции // РасширениеБезТочки()

&НаКлиенте
Процедура УдалитьТекущееСообщение()
	
	Если Элементы.ВходящиеСообщения.ТекущаяСтрока <> Неопределено Тогда
		Строки = Новый Массив();
		Строки.Добавить(Элементы.ВходящиеСообщения.ТекущаяСтрока);
		УдалитьСообщенияСервер(Строки);
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура УдалитьСообщение(Команда)
	
	Строки = Новый Массив();
	Для каждого Строка из Элементы.ВходящиеСообщения.ВыделенныеСтроки Цикл
		Строки.Добавить(Строка);
	КонецЦикла;	
	
	Если Строки.Количество() > 0 Тогда
		Состояние(НСтр("ru = 'Идет удаление отмеченных сообщений. Пожалуйста, подождите...'"));
		УдалитьСообщенияСервер(Строки);
		Состояние(НСтр("ru = 'Удаление отмеченных сообщений завершено.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСообщенияСервер(ИдентификаторыСтрок)
	
	ИдентификаторыСообщений = Новый Массив();
	Для каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		Ид = ВходящиеСообщения.НайтиПоИдентификатору(ИдентификаторСтроки).Идентификатор;
		ИдентификаторыСообщений.Добавить(Ид);	
	КонецЦикла;	
	
	Профиль = ЭлектроннаяПочта.СформироватьИнтернетПрофиль(УчетнаяЗаписьВходящие);
	
	Соединение = Новый ИнтернетПочта;
	
	Соединение.Подключиться(Профиль);
	Соединение.УдалитьСообщения(ИдентификаторыСообщений);
	Соединение.Отключиться();

	Для каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		Ид = ВходящиеСообщения.НайтиПоИдентификатору(ИдентификаторСтроки);
		ВходящиеСообщения.Удалить(Ид);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьВходящиеПриИзменении(Элемент)
	
	ОбновитьСписокСообщений();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьУчетнуюЗапись(СообщениеОбОшибке)
	
	Если УчетнаяЗаписьВходящие.ОставлятьКопииСообщенийНаСервере	<> Истина Тогда 
		СообщениеОбОшибке = НСтр("ru = 'В учетной записи не установлен флажок ""Оставлять копии сообщений на сервере"".'");
		Возврат Ложь;
	КонецЕсли;
	
	Если УчетнаяЗаписьВходящие.ИспользоватьДляПолучения	<> Истина Тогда
		СообщениеОбОшибке = НСтр("ru = 'В учетной записи не установлен флажок ""Использовать для получения"".'");
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьСписокСообщений()
	
	ВходящиеСообщения.Очистить();
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьВходящие) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана учетная запись.'"),,,"УчетнаяЗаписьВходящие");
		Возврат;
	КонецЕсли;
	
	СообщениеОбОшибке = "";
	Если Не ПроверитьУчетнуюЗапись(СообщениеОбОшибке) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,"УчетнаяЗаписьВходящие");
		Возврат;
	КонецЕсли;	
	
	Состояние(НСтр("ru = 'Идет загрузка электронной почты. Пожалуйста, подождите...'"));
	
	Если ПарольЗадан(УчетнаяЗаписьВходящие) Тогда
		ПарольПараметр = Неопределено;
	Иначе
		ПарольПараметр = ЗапросПароляДоступаКПочтовомуСерверу(УчетнаяЗаписьВходящие);
		Если ПарольПараметр = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ОбновитьСписокСообщенийСервер(ПарольПараметр);
	Исключение
		Предупреждение(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Состояние(НСтр("ru = 'Загрузка электронной почты завершена.'"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокСообщенийСервер(ПарольПараметр)
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьВходящие) Тогда
		СообщениеОбОшибке = "";
		Если Не ПроверитьУчетнуюЗапись(СообщениеОбОшибке) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,"УчетнаяЗаписьВходящие");
			Возврат;
		КонецЕсли;
		
		Результат = ЗагрузитьВходящиеСообщения(ПарольПараметр);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Учетная запись для получения входящих не заполнена'"),,,"УчетнаяЗаписьВходящие");
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УчетныеЗаписиЭлектроннойПочты.Ссылка
	               |ИЗ
	               |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	               |ГДЕ
	               |	УчетныеЗаписиЭлектроннойПочты.ОтветственныйЗаОбработкуПисем = &ТекущийПользователь";
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		УчетнаяЗаписьВходящие = Выборка.Ссылка;
		
		Попытка
			Если ПарольЗадан(УчетнаяЗаписьВходящие) Тогда
				ОбновитьСписокСообщенийСервер(Неопределено);
			КонецЕсли	
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнутреннийДокумент(Команда)
	
	Если Элементы.ВходящиеСообщения.ТекущаяСтрока <> Неопределено Тогда
		
		Форма = ПолучитьФорму("Обработка.ЗагрузкаЭлектроннойПочты.Форма.ФормаДобавленияВнутреннегоДокумента", );
		Если Форма.ОткрытьМодально() <> КодВозвратаДиалога.ОК Тогда 
			Возврат;
		КонецЕсли;	
		
		Состояние(НСтр("ru = 'Идет регистрация внутреннего документа. Пожалуйста, подождите...'"));
		ВнутреннийДокумент = СоздатьВнутреннийДокумент(
			Элементы.ВходящиеСообщения.ТекущаяСтрока,
			Форма.Папка,
			Форма.ВидДокумента,
			Форма.Организация);
			
		Если Не ВнутреннийДокумент.Пустая() Тогда
			УдалитьТекущееСообщение();
			ИзвлечьТекстыИзФайлов(ВнутреннийДокумент);
			ОткрытьЗначение(ВнутреннийДокумент);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьВнутреннийДокумент(НомерПисьма, Папка, ВидДокумента, Организация)
	
	Письмо = ВходящиеСообщения.НайтиПоИдентификатору(НомерПисьма);

	// Создаем нутренний документ
	ВнутреннийДокумент = Справочники.ВнутренниеДокументы.СоздатьЭлемент();
	ВнутреннийДокумент.Заголовок = Письмо.Тема;
	ВнутреннийДокумент.Содержание = Письмо.Содержание;
	ВнутреннийДокумент.ДатаСоздания = Письмо.ДатаПолучения;
	ВнутреннийДокумент.Папка = Папка;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыВнутреннихДокументов") Тогда
		ВнутреннийДокумент.ВидДокумента = ВидДокумента;
	КонецЕсли;	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		ВнутреннийДокумент.Организация = Организация;
	КонецЕсли;	
	
	НачатьТранзакцию();
	Попытка
		ВнутреннийДокумент.Записать();
		Делопроизводство.ЗаписатьСостояниеДокумента(
			ВнутреннийДокумент.Ссылка, 
			ТекущаяДата(), 
			Перечисления.СостоянияДокументов.Проект, 
			ОбщегоНазначения.ТекущийПользователь());
		
		// Сохраняем все файлы на диске
		Для каждого Вложение Из Письмо.Вложения Цикл
			
			ВрФайл = Новый Файл(Вложение.Имя);
			ИмяФайла = ВрФайл.ИмяБезРасширения;
			РасширениеФайла = РасширениеБезТочки(ВрФайл.Расширение);
			
			// Создадим карточку Файла в БД
			НовыйФайл = РаботаСФайлами.СоздатьФайлСВерсией(
				ВнутреннийДокумент.Ссылка,
				ИмяФайла,
				РасширениеФайла,
				ТекущаяДата(),
				УниверсальноеВремя(ТекущаяДата()),
				Вложение.Размер,
				Вложение.НавигационнаяСсылка,
				"",
				Ложь); // это не веб клиент				
				
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
	     ОтменитьТранзакцию();
	     ВызватьИсключение;
	КонецПопытки;
	
	Возврат ВнутреннийДокумент.Ссылка;
	
КонецФункции
